app/controllers/apps_controller.rb

SELECT "apps".* FROM "apps" INNER JOIN installs ON apps.id = installs.app_id WHERE (("installs".user_id = 1))
SELECT * FROM "apps" WHERE ("apps"."name" = 'Shazam')
---
  def index
    if @user
      @apps = @user.apps.find(:all)
    else
      name = params[:name]
      if name
        @apps = App.find_all_by_name(name)

INSERT INTO "apps" ("name", "updated_at", "created_at") VALUES('test', '2009-03-12 15:23:57', '2009-03-12 15:23:57')
---
  def create
    if @user
      @app = @user.apps.build(params[:app])
    else
      @app = App.new(params[:app])
    end

    respond_to do |format|
      if @app.save

SELECT * FROM "apps" WHERE ("apps"."id" = 1)
---
    def load_app
      if params[:id]
        @app = App.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
    def load_user
      if params[:user_id]
        @user = User.find(params[:user_id])