app/controllers/users_controller.rb

  def index
    @users = User.paginate(:order => 'active, updated_at', :page => params[:page], :per_page => 10)
---
SELECT * FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "login", "created_at") VALUES('2009-03-12 12:49:39', 'floehopper', '2009-03-12 12:49:39')