webapp/app/controllers/installs_controller.rb

SELECT * FROM "installs" WHERE ("installs".user_id = 22)
---
  def index
    if @user
      @installs = @user.installs.find(:all)

SELECT * FROM "installs" WHERE ("installs"."id" = 1)
---
  def show
    @install = Install.find(params[:id])

SELECT * FROM "installs" WHERE ("installs"."id" = 4)
---
  def edit
    @install = Install.find(params[:id])

INSERT INTO "installs" ("updated_at", "app_id", "user_id", "created_at") VALUES('2009-03-12 15:27:28', 1, 1, '2009-03-12 15:27:28')
---
  def create
    if @user
      @install = @user.installs.build(params[:install])
    else
      @install = Install.new(params[:install])
    end

    respond_to do |format|
      if @install.save

SELECT * FROM "installs" WHERE ("installs"."id" = 4)
UPDATE "installs" SET "app_id" = 5, "updated_at" = '2009-03-12 21:36:13' WHERE "id" = 4
---
  def update
    @install = Install.find(params[:id])

    respond_to do |format|
      if @install.update_attributes(params[:install])

SELECT * FROM "installs" WHERE ("installs"."id" = 3)
DELETE FROM "installs" WHERE "id" = 3
---
  def destroy
    @install = Install.find(params[:id])
    @install.destroy

SELECT * FROM "users" WHERE ("users"."id" = 22)
---
  def load_user
    if params[:user_id]
      @user = User.find(params[:user_id])